Revit 2027 API
BuiltInFailures.ViewFailures.TurnCropRegionOffRemovesViewBreaks Property
 Turning off the Crop Region of the view will remove all View Breaks. If the Crop Region is turned on at a later time, any desired View Breaks must be created again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TurnCropRegionOffRemovesViewBreaks { get; }
Public Shared ReadOnly Property TurnCropRegionOffRemovesViewBreaks As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TurnCropRegionOffRemovesViewBreaks {
	FailureDefinitionId^ get ();
}
static member TurnCropRegionOffRemovesViewBreaks : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace